app/code/Kensium/Amconnector/etc/amconnector/GetEndPointVersion.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <Get xmlns="http://www.acumatica.com/entity/5.30.001/AmconnectorConfig/">
            <entity xsi:type="EndPointVersion">
                <ID xsi:nil="true"/>
                <Delete>false</Delete>
                <GateVersion xsi:nil="true"/>
                <InterfaceName>
                    <Value>Default</Value>
                    <HasError>false</HasError>
                </InterfaceName>
            </entity>
        </Get>
    </soap:Body>
</soap:Envelope>